# Handling Missing Values

#### 1. use python dropna function
#### 2. use python fillna function
#### 3. use interpolate method
#### 4. use python replace function

In [15]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [35]:
df_sales = pd.read_excel('04 Handling Missing Data using Python_Saless.xlsx')
df_sales

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
2,2020-10-03,3,3,31.0,NaN,2774.0,A
3,2020-10-04,1,2,29.0,105.0,3182.0,NaN
4,2020-10-05,1,2,33.0,104.0,1368.0,B
5,2020-10-07,2,2,NaN,NaN,NaN,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
7,2020-11-25,3,3,NaN,96.0,NaN,NaN
8,2020-11-26,2,2,27.0,100.0,2356.0,B
9,2020-11-28,3,1,NaN,NaN,NaN,A
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

In [36]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             12 non-null     datetime64[ns]
 1   Store_Type       12 non-null     int64
 2   City_Type        12 non-null     int64
 3   Day_Temp         9 non-null      float64
 4   No_of_Customers  9 non-null      float64
 5   Sales            9 non-null      float64
 6   Product_Quality  10 non-null     object
dtypes: datetime64[ns](1), float64(3), int64(2), object(1)
memory usage: 804.0+ bytes

In [28]:
df_sales_nan = df_sales.dropna()
df_sales_nan

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
4,2020-10-05,1,2,33.0,104.0,1368.0,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
8,2020-11-26,2,2,27.0,100.0,2356.0,B
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

In [29]:
df_sales_nan = df_sales.dropna(how='all')
df_sales_nan

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
2,2020-10-03,3,3,31.0,NaN,2774.0,A
3,2020-10-04,1,2,29.0,105.0,3182.0,NaN
4,2020-10-05,1,2,33.0,104.0,1368.0,B
5,2020-10-07,2,2,NaN,NaN,NaN,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
7,2020-11-25,3,3,NaN,96.0,NaN,NaN
8,2020-11-26,2,2,27.0,100.0,2356.0,B
9,2020-11-28,3,1,NaN,NaN,NaN,A
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

In [30]:
df_sales_nan = df_sales.dropna(thresh=1)
df_sales_nan

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
2,2020-10-03,3,3,31.0,NaN,2774.0,A
3,2020-10-04,1,2,29.0,105.0,3182.0,NaN
4,2020-10-05,1,2,33.0,104.0,1368.0,B
5,2020-10-07,2,2,NaN,NaN,NaN,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
7,2020-11-25,3,3,NaN,96.0,NaN,NaN
8,2020-11-26,2,2,27.0,100.0,2356.0,B
9,2020-11-28,3,1,NaN,NaN,NaN,A
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

## Fillna

In [31]:
df_sales_fillna = df_sales.fillna(0)
df_sales_fillna

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
2,2020-10-03,3,3,31.0,0.0,2774.0,A
3,2020-10-04,1,2,29.0,105.0,3182.0,0
4,2020-10-05,1,2,33.0,104.0,1368.0,B
5,2020-10-07,2,2,0.0,0.0,0.0,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
7,2020-11-25,3,3,0.0,96.0,0.0,0
8,2020-11-26,2,2,27.0,100.0,2356.0,B
9,2020-11-28,3,1,0.0,0.0,0.0,A
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

In [33]:
df_sales_fillna = df_sales.fillna({
    "Day_Temp": df_sales.Day_Temp.mean(),
    "No_of_Customers": df_sales.No_of_Customers.median(),
    "Product_Quality": "A"
})
df_sales_fillna

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.000000,100.0,3112.0,A
1,2020-10-02,2,1,32.000000,115.0,3682.0,A
2,2020-10-03,3,3,31.000000,100.0,2774.0,A
3,2020-10-04,1,2,29.000000,105.0,3182.0,A
4,2020-10-05,1,2,33.000000,104.0,1368.0,B
5,2020-10-07,2,2,28.111111,100.0,NaN,B
6,2020-11-24,2,3,26.000000,90.0,4232.0,C
7,2020-11-25,3,3,28.111111,96.0,NaN,A
8,2020-11-26,2,2,27.000000,100.0,2356.0,B
9,2020-11-28,3,1,28.111111,100.0,NaN,A
10,2020-11-29,1,1,23.000000,94.0,1254.0,A
11,2020-11-30,1,1,22.000000,91.0,4232.0,A

In [34]:
df_sales_fillna = df_sales.fillna({
    "Day_Temp": df_sales.Day_Temp.mean(),
    "No_of_Customers": df_sales.No_of_Customers.median(),
    "Product_Quality": df_sales.Product_Quality.mode()
})
df_sales_fillna

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.000000,100.0,3112.0,A
1,2020-10-02,2,1,32.000000,115.0,3682.0,A
2,2020-10-03,3,3,31.000000,100.0,2774.0,A
3,2020-10-04,1,2,29.000000,105.0,3182.0,NaN
4,2020-10-05,1,2,33.000000,104.0,1368.0,B
5,2020-10-07,2,2,28.111111,100.0,NaN,B
6,2020-11-24,2,3,26.000000,90.0,4232.0,C
7,2020-11-25,3,3,28.111111,96.0,NaN,NaN
8,2020-11-26,2,2,27.000000,100.0,2356.0,B
9,2020-11-28,3,1,28.111111,100.0,NaN,A
10,2020-11-29,1,1,23.000000,94.0,1254.0,A
11,2020-11-30,1,1,22.000000,91.0,4232.0,A

## FFill

In [38]:
df_sales_ffill = df_sales.ffill()
df_sales_ffill

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
2,2020-10-03,3,3,31.0,115.0,2774.0,A
3,2020-10-04,1,2,29.0,105.0,3182.0,A
4,2020-10-05,1,2,33.0,104.0,1368.0,B
5,2020-10-07,2,2,33.0,104.0,1368.0,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
7,2020-11-25,3,3,26.0,96.0,4232.0,C
8,2020-11-26,2,2,27.0,100.0,2356.0,B
9,2020-11-28,3,1,27.0,100.0,2356.0,A
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

In [39]:
df_sales_bfill = df_sales.bfill()
df_sales_bfill

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
2,2020-10-03,3,3,31.0,105.0,2774.0,A
3,2020-10-04,1,2,29.0,105.0,3182.0,B
4,2020-10-05,1,2,33.0,104.0,1368.0,B
5,2020-10-07,2,2,26.0,90.0,4232.0,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
7,2020-11-25,3,3,27.0,96.0,2356.0,B
8,2020-11-26,2,2,27.0,100.0,2356.0,B
9,2020-11-28,3,1,23.0,94.0,1254.0,A
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

In [40]:
df_sales_1 = df_sales.bfill(axis="columns")
df_sales_1

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01 00:00:00,1,1,30.0,100.0,3112.0,A
1,2020-10-02 00:00:00,2,1,32.0,115.0,3682.0,A
2,2020-10-03 00:00:00,3,3,31.0,2774.0,2774.0,A
3,2020-10-04 00:00:00,1,2,29.0,105.0,3182.0,NaN
4,2020-10-05 00:00:00,1,2,33.0,104.0,1368.0,B
5,2020-10-07 00:00:00,2,2,B,B,B,B
6,2020-11-24 00:00:00,2,3,26.0,90.0,4232.0,C
7,2020-11-25 00:00:00,3,3,96.0,96.0,NaN,NaN
8,2020-11-26 00:00:00,2,2,27.0,100.0,2356.0,B
9,2020-11-28 00:00:00,3,1,A,A,A,A
10,2020-11-29 00:00:00,1,1,23.0,94.0,1254.0,A
11,2020-11-30 00:00:00,1,1,22.0,91.0,4232.0,A

In [42]:
df_sales_1 = df_sales.bfill(limit=1)
df_sales_1

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
2,2020-10-03,3,3,31.0,105.0,2774.0,A
3,2020-10-04,1,2,29.0,105.0,3182.0,B
4,2020-10-05,1,2,33.0,104.0,1368.0,B
5,2020-10-07,2,2,26.0,90.0,4232.0,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
7,2020-11-25,3,3,27.0,96.0,2356.0,B
8,2020-11-26,2,2,27.0,100.0,2356.0,B
9,2020-11-28,3,1,23.0,94.0,1254.0,A
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

In [46]:
data = {'A': [1, np.nan, np.nan, 4]}
index = pd.to_datetime(['2025-02-01', '2025-02-02', '2025-02-05', '2025-02-10'])
df = pd.DataFrame(data, index=index)
df_interpolated = df.interpolate(method="time")
print(df_interpolated)

                   A
2025-02-01  1.000000
2025-02-02  1.333333
2025-02-05  2.333333
2025-02-10  4.000000

In [49]:
data = {'A': [1, np.nan, np.nan, 4]}
df = pd.DataFrame(data)
df_interpolated = df.interpolate(method="pad")
print(df_interpolated)

     A
0  1.0
1  1.0
2  1.0
3  4.0

C:\Windows\Temp\ipykernel_19464\2848408648.py:3: FutureWarning: DataFrame.interpolate with method=pad is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_interpolated = df.interpolate(method="pad")

In [50]:
data = {'A': [1, np.nan, np.nan, 4]}
df = pd.DataFrame(data)
df_interpolated = df.interpolate("nearest")
print(df_interpolated)

     A
0  1.0
1  1.0
2  4.0
3  4.0

In [52]:
data = {'A': [1, np.nan, np.nan, 4]}
df = pd.DataFrame(data, index=[10, 20, 30, 40])
df_interpolated = df.interpolate(method="index")
print(df_interpolated)

      A
10  1.0
20  2.0
30  3.0
40  4.0

#### 1. Interpolate the dataset's date field in the Excel sheet

In [66]:
df = pd.read_excel('04 Handling Missing Data using Python_Saless.xlsx', index_col=0, parse_dates=[0])

data = {'A': [1, np.nan, np.nan, 4]}
df_new = pd.DataFrame(data, index=df.index[:4])

df_interpolated = df_new.interpolate(method="time")
print(df_interpolated)

              A
Date
2020-10-01  1.0
2020-10-02  2.0
2020-10-03  3.0
2020-10-04  4.0

#### 2. dataset containing daily temperature readings for a city over a month. However, some temperature values are missing due to sensor malfunctions. Your task is to clean the dataset by filling in the missing values using appropriate interpolation methods and analyze the results.

In [69]:
df = pd.read_csv('test1.csv', parse_dates=['Date'], index_col='Date')
df['Temperature'] = pd.to_numeric(df['Temperature'], errors='coerce')
df_interpolated = df.interpolate(method='time')
print(df_interpolated)

            Temperature
Date
2023-10-01         22.0
2023-10-02         23.0
2023-10-03         24.0
2023-10-04         25.0
2023-10-05         24.0
2023-10-06         25.0
2023-10-07         26.0

## Replace

In [70]:
df_sales_replace = df_sales.replace(np.nan, 0)
df_sales_replace

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
2,2020-10-03,3,3,31.0,0.0,2774.0,A
3,2020-10-04,1,2,29.0,105.0,3182.0,0
4,2020-10-05,1,2,33.0,104.0,1368.0,B
5,2020-10-07,2,2,0.0,0.0,0.0,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
7,2020-11-25,3,3,0.0,96.0,0.0,0
8,2020-11-26,2,2,27.0,100.0,2356.0,B
9,2020-11-28,3,1,0.0,0.0,0.0,A
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

In [75]:
def_sales_rp3 = df_sales_replace.replace(
    {np.nan: None, "Day_Temp": 28.0, "Product_Quality": "A", "No_of_Customers": 99.0, "Sales": 2910.0})

In [74]:
df_city1 = pd.DataFrame({'City': ['How London', 'Holand', 'Pow Delhi', 'Mumbai', 'new Jersey'],
                         'Event': ['Footbal', 'Singing', 'Cricket', 'Music', 'Idea'],
                         'Cost': [300, 200, 159, 450, 120]})
df_city1

         City    Event  Cost
0  How London  Footbal   300
1      Holand  Singing   200
2   Pow Delhi  Cricket   159
3      Mumbai    Music   450
4  new Jersey     Idea   120

In [76]:
df_city_new1 = df_city1.replace(['How London', 'Holand', 'Pow Delhi', 'Mumbai', 'new Jersey'],
                                ['London', 'Holland', 'Delhi', 'Bombay', 'New York'])

## Handling Duplicate Data

- Combine datasets from multiple places
- Scrape Data (Collect Data through web scraping)
- Receive data from clients/ other departments

In [79]:
data = {"Name": ["Alice", "Bob", "Alice", "Charlie", "Bob"], 'Age': [25, 30, 25, 28, 30]}
df = pd.DataFrame(data)
df = df.drop_duplicates()
print(df)

      Name  Age
0    Alice   25
1      Bob   30
3  Charlie   28

In [80]:
df = pd.DataFrame({"Name": ["John", "Rock", "Nail", "Tom", "John", "John"], 'Rank': [1, 2, 3, 6, 1, 1],
                   'Marks': [98, 59, 97, 99, 100, 100]})

#### 3. Using "01 Handlining Duplicate Data_adult.csv" remove all duplicate values

In [88]:
adults = pd.read_csv('01 Handlining Duplicate Data_adult.csv')
data_frame = pd.DataFrame(adults)
duplicates_before = data_frame.duplicated(keep=False).sum()
removed_duplicates = data_frame.drop_duplicates()
duplicates_after = removed_duplicates.duplicated().sum()

print(duplicates_before)
print(duplicates_after)

18
0

## Handling Irrelevant Data

In [89]:
df_titanic = pd.read_csv('02 Handling Irrelevant Data_titanic_train.csv')
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [90]:
df_titanic.drop(["Name", "Ticket"], inplace=True, axis=1)

## Handling Structural Errors

In [91]:
df_titanic = pd.read_csv('03 Handling Structural Error_titanic_train.csv')

In [92]:
df_titanic.dtypes

PassengerId      int64
Survived         int64
Pclass          object
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare            object
Cabin           object
Embarked        object
dtype: object

In [93]:
df_titanic["Fare"] = df_titanic["Fare"].str.replace("$", "").astype(float)

In [94]:
df_titanic.dtypes

PassengerId      int64
Survived         int64
Pclass          object
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [97]:
df_titanic["Sex_r"] = list(map(lambda x: x.endswith(""), df_titanic["Sex"]))
df_titanic["Sex_r"] = list(map(lambda x: x.startswith(""), df_titanic["Sex"]))
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_r
0,1,0,Third,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,True
1,2,1,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.28,C85,C,True
2,3,1,Third,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.93,NaN,S,True
3,4,1,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.10,C123,S,True
4,5,0,Third,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,Second,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,True
887,888,1,First,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,True
888,889,0,Third,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,True
889,890,1,First,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,True
890,891,0,Third,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,True

In [101]:
print(df_titanic[df_titanic["Sex_r"] == True])

     PassengerId  Survived  Pclass  \
0              1         0   Third
1              2         1   First
2              3         1   Third
3              4         1   First
4              5         0   Third
..           ...       ...     ...
886          887         0  Second
887          888         1   First
888          889         0   Third
889          890         1   First
890          891         0   Third

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket   Fare Cabin Embarked  Sex_r
0        0         A/5 21171   7.25   NaN        S   True
1        0          PC 17599  71.28   C85        C   True
2        0  STON/O2. 3101282   7.93   NaN        S   True
3        0            113803  53.10  C123        S   True
4        0            373450   8.05   NaN        S   True
..     ...               ...    ...   ...      ...    ...
886      0            211536  13.00   NaN        S   True
887      0            112053  30.00   B42        S   True
888      2        W./C. 6607  23.45   NaN        S   True
889      0            111369  30.00  C148        C   True
890      0            370376   7.75   NaN        Q   True

[891 rows x 13 columns]

In [102]:
list(map(lambda x: x.strip(), df_titanic["Sex"]))

['male',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'female',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'fem',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'fem',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'fem',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'fem',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'mal',
 'male',
 'male',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'mal',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'female',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'fem',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'female',
 'female',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'fem',
 'female',
 'male',
 'female',
 'male',
 'female',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'female',
 'female',
 'male',
 'male',
 'female',
 'mal',
 'male',
 'male',
 'female',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'female',
 'mal',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'fem',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'mal',
 'female',
 'female',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'mal',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'fem',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'female',
 'male',
 'female',
 'male',
 'female',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'mal',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'fem',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'mal',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'mal',
 'female',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'fem',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'mal',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'fem',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'mal',
 'male',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'female',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'male',
 'female',
 'male',
 'male',
 'female',
 'female',
 'male',
 'male',
 'male',
 'female',
 'female',
 'male',
 'female',
 'male',
 'male',
 'female',
 'male',
 'female',
 'female',
 'male',
 'male']

## Input Missing values with Mean/Median/Mode

In [103]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [104]:
df_titanic = pd.read_csv("05 Hands-on Handling missing value using Mean Median mode_titanic_train.csv")
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [107]:
from sklearn.impute import SimpleImputer

data = {
    'Student': ['A', 'B', 'C', 'D', 'E'],
    'Math Score': [85, 90, 78, None, 88],
    'English Score': [78, 82, None, 70, 85],
    'Science Score': [92, None, 88, 85, 90]
}
df = pd.DataFrame(data)
mean_imputer = SimpleImputer(strategy='mean')
df_mean_imputed = df.copy()
df_mean_imputed.iloc[:, 1:] = mean_imputer.fit_transform(df_mean_imputed.iloc[:, 1:])
print("Dataframe after mean imputation:")
print(df_mean_imputed)

Dataframe after mean imputation:
  Student  Math Score  English Score  Science Score
0       A       85.00          78.00          92.00
1       B       90.00          82.00          88.75
2       C       78.00          78.75          88.00
3       D       85.25          70.00          85.00
4       E       88.00          85.00          90.00

In [113]:
df_sales = pd.read_excel('04 Handling Missing Data using Python_Saless.xlsx')
df_sales

,Date,Store_Type,City_Type,Day_Temp,No_of_Customers,Sales,Product_Quality
0,2020-10-01,1,1,30.0,100.0,3112.0,A
1,2020-10-02,2,1,32.0,115.0,3682.0,A
2,2020-10-03,3,3,31.0,NaN,2774.0,A
3,2020-10-04,1,2,29.0,105.0,3182.0,NaN
4,2020-10-05,1,2,33.0,104.0,1368.0,B
5,2020-10-07,2,2,NaN,NaN,NaN,B
6,2020-11-24,2,3,26.0,90.0,4232.0,C
7,2020-11-25,3,3,NaN,96.0,NaN,NaN
8,2020-11-26,2,2,27.0,100.0,2356.0,B
9,2020-11-28,3,1,NaN,NaN,NaN,A
10,2020-11-29,1,1,23.0,94.0,1254.0,A
11,2020-11-30,1,1,22.0,91.0,4232.0,A

In [114]:
df_sales = pd.read_excel('04 Handling Missing Data using Python_Saless.xlsx')
df = pd.DataFrame(df_sales)
mean_imputer = SimpleImputer(strategy='mean')
numeric_columns = df.select_dtypes(include=['float64', 'int64']).columns
df_mean_imputed = df.copy()
df_mean_imputed[numeric_columns] = mean_imputer.fit_transform(df_mean_imputed[numeric_columns])
print("Dataframe after mean imputation:")
print(df_mean_imputed)

Dataframe after mean imputation:
         Date  Store_Type  City_Type   Day_Temp  No_of_Customers        Sales  \
0  2020-10-01         1.0        1.0  30.000000       100.000000  3112.000000
1  2020-10-02         2.0        1.0  32.000000       115.000000  3682.000000
2  2020-10-03         3.0        3.0  31.000000        99.444444  2774.000000
3  2020-10-04         1.0        2.0  29.000000       105.000000  3182.000000
4  2020-10-05         1.0        2.0  33.000000       104.000000  1368.000000
5  2020-10-07         2.0        2.0  28.111111        99.444444  2910.222222
6  2020-11-24         2.0        3.0  26.000000        90.000000  4232.000000
7  2020-11-25         3.0        3.0  28.111111        96.000000  2910.222222
8  2020-11-26         2.0        2.0  27.000000       100.000000  2356.000000
9  2020-11-28         3.0        1.0  28.111111        99.444444  2910.222222
10 2020-11-29         1.0        1.0  23.000000        94.000000  1254.000000
11 2020-11-30         1.0        1.0  22.000000        91.000000  4232.000000

   Product_Quality
0                A
1                A
2                A
3              NaN
4                B
5                B
6                C
7              NaN
8                B
9                A
10               A
11               A